[
    {
        "judul": "1. Perangkat Masukan (Input Devices)",
        "deskripsi": "Peranti masukan adalah perangkat yang mengirimkan data ke komputer untuk diolah, seperti:",
        "perangkat": [
            {
                "nama": "A.Mouse wireless Bluetooth",
                "gambar": "gambar1.png",
                "fungsi": "Menggerakkan kursor dan memilih menu.",
                "penjelasan": "Mouse atau tetikus digunakan untuk menggerakkan dan mengatur posisi kursor di layar komputer.Pengoperasian mouse dapat dengan beberapa cara.Tunjuk (Point), posisikan: Mouse akan menunjuk ke suatu objek antarmuka di layar komputer.Klik kiri (Left Click): Menekan tombol mouse sekali dan segera melepaskannya. Klik ganda (Double Click): Menekan tombol mouse dua kali berurutan dengan cepat tanpa menggeser mouse. Klik kanan (Right Click): Klik kanan dapat dilakukan satu kali untuk menampilkan menu tertentu.Seret (Drag): Digunakan untuk memindahkan suatu objek antarmuka seperti gambar, icon, teks, dan sebagainya. Caranya dengan menunjuk objek yang akan dipindah sambil menekan tombol kiri mouse, lalu geser mouse sesuai yang dikehendaki.Setelah sampai pada bagian yang dikehendaki tombol mouse dilepas"
            },
            {
                "nama": "B.QWERTY Keyboard",
                "gambar": "keyboard.png",
                "fungsi": "Mengetik teks dan simbol.",
                "penjelasan": "Keyboard QWERTY, yaitu keyboard dengan tata letak paling populer yang didasarkan pada enam huruf pertama pada papan ketik mesin tik. Desain QWERTY dibuat agar huruf yang paling umum tidak akan membuat mesintik mekanis “macet”, atau berhenti bekerja."
            },
            {
                "nama": "C.Photo Scanner",
                "gambar": "scanner.png",
                "fungsi": "Memindai dokumen ke format digital.",
                "penjelasan": "Scanner digunakan untuk memindai dan menyalin Data dari kertas berisi grafik, gambar, foto, atau tulisan menggunakan alat pembaca optical data reader. Cara kerja scanner adalah dengan menempatkan sebuah obyek di atas kaca scanner,yang kemudian akan dibaca oleh optical data reader"
            },
            {
                "nama": "D.Joystick",
                "gambar": "joystick.png",
                "fungsi": "Mengontrol permainan.",
                "penjelasan": "Joystick digunakan sebagai pelengkap untuk memainkan permainan/game video yang menggunakan lebih dari satu tombol. Joystick digunakan untuk menggerakan kursor pada layar permainan. Elemen-elemen joystick adalah:1. Stick/tuas, 2. Base/alas, 3. Trigger/Pemicu, 4. Tombol ekstra, 5. Sakelar autofire, 6. Sakelar throttle, 7. Sakelar tapi (POV hat), 8. Cangkir penyedot"
            },
            {
                "nama": "E.Microphone",
                "gambar": "mic.png",
                "fungsi": "Merekam suara.",
                "penjelasan": " Microphone adalah peranti yang mengonversi suara menjadi sinyal elektrik. Peranti ini digunakan untuk memasukkan suara ke komputer.Suara tersebut dapat direkam sebagai perintah untuk komputer, atau diteruskan melalui media komunikasi antarkomputer."
            },
            {
                "nama": "F.Barcode Reader",
                "gambar": "bercode.png",
                "fungsi": "Membaca kode batang produk.",
                "penjelasan": "Barcode reader adalah pemindai optis yang dapat membaca barcode yang tercetak, mengubah kode bar tersebut menjadi data elektrik dan mengirimkannya ke komputer dengan format data yang sederhana."
            }
        ]
    },
    {
        "judul": "2. Perangkat Pemroses",
        "deskripsi": "Data atau perintah yang diterima dari peranti masukan selanjutnya akan diproses oleh komputer. Pemroses ini terdiri atas banyak komponen, yaituseperti berikut.",
        "perangkat": [
            {
                "nama": "A.CPU",
                "gambar": "prosesor.png",
                "fungsi": "Pusat kendali dan perhitungan komputer (CU & ALU).",
                "penjelasan": "CPU adalah otak komputer yang bertugas menjalankan semua instruksi, seperti operasi aritmatika, logika, pengendalian, dan input/output dasar.Komponen utama CPU: Control Unit (CU): Mengatur dan mengendalikan jalannya instruksi.Arithmetic Logic Unit (ALU): Menjalankan perhitungan dan operasi logika.Register: Menyimpan data sementara yang sedang diproses.CPU terpasang di mainboard (motherboard) dan terhubung dengan perangkat lain seperti memori utama, alat input/output, dan GPU (untuk grafis).Kecepatan CPU diukur dalam satuan Hertz (Hz), umumnya dalam skala MHz atau GHz."
            },
            {
                "nama": "B.RAM",
                "gambar": "ram.png",
                "fungsi": "Menyimpan data sementara.",
                "penjelasan": "RAM (Random Access Memory) adalah memori cepat yang menyimpan data sementara saat komputer memproses informasi. Data dari penyimpanan sekunder akan dimuat ke RAM agar bisa diolah CPU lebih cepat. file tersebut dimuat dan dimanipulasi di RAM.RAM memungkinkan akses data secara acak, tanpa urutan tertentu. Karena menggunakan arus listrik dan transistor, RAM memiliki latensi rendah, tetapi data akan hilang saat listrik mati."
            },
            {
                "nama": "C.ROM",
                "gambar": "rom.png",
                "fungsi": "Menyimpan instruksi permanen BIOS.",
                "penjelasan": "ROM adalah memori pada komputer yang digunakan untuk menyimpan instruksi yang ditulis oleh produsen komputer untuk proses booting, instruksi yang disimpan oleh ROM disebut firmware. Data yang pernah ditulis di ROM tidak dapat dihapus. Instruksi ROM dijalankan secara otomatis saat komputer menyala. Pada komputer,ROM bisa berisi sistem operasi kecil yang disebut Basic Input Output System (BIOS)"
            }
        ]
    },
    {
        "judul": "3. Perangkat Keluaran (Output Devices)",
        "deskripsi": "Peranti keluaran adalah peralatan yang menyajikan informasi dari komputer yang bisa berupa tampilan di layar monitor, gambar tercetak, suara yang  dihasilkan oleh speaker, dan lainnya. Peranti keluaran di antaranya adalah sebagai berikut.",
        "perangkat": [
            {
                "nama": "A.Monitor",
                "gambar": "layarmonitor.png",
                "fungsi": "Menampilkan informasi visual.",
                "penjelasan": "Layar monitor berfungsi untuk menampilkan hasil pengolahan data di komputer, seperti gambar, teks, angka, grafik, dan sebagainya. Ada beberapa jenis monitor yang biasa digunakan, seperti Cathode Ray Tube (CRT), Liquid Crystal Display (LCD), dan Light Emitting Diode (LED)"
            },
            {
                "nama": "B.Printer",
                "gambar": "printer.png",
                "fungsi": "Mencetak informasi ke media kertas.",
                "penjelasan": "Printer digunakan untuk mencetak gambar, foto, dokumen dalam bentuk media kertas. Ada beberapa jenis printer yang kini masih digunakan di antaranya printer dot matrix, inkjet, laserjet, dan plotter"
            },
            {
                "nama": "C.Speaker",
                "gambar": "speaker.png",
                "fungsi": "Mengeluarkan suara dari komputer.",
                "penjelasan": "Alat untuk menghasilkan suara dari komputer,seperti musik, percakapan di film, dan efek suara lainnya dinamakan speaker"
            }
        ]
    },
    {
        "judul": "4. Perangkat Penyimpanan Sekunder",
        "deskripsi": "Adalah media penyimpanan data permanen yang menyimpan data meskipun listrik mati (non-volatile). Jenis-jenisnya: 1. Hard Disk Drive (HDD) Menggunakan piringan magnetik untuk menyimpan data. Kapasitas umum: 256 GB – 18 TB. Komponen utama: piringan logam, head baca-tulis, rangkaian elektronik. Data tidak hilang meskipun listrik mati. 2. Solid State Drive (SSD) Menggunakan flash memory tanpa komponen bergerak.Lebih cepat, tahan guncangan, dan tidak berisik dibanding HDD. Kapasitas hingga 100 TB (2019).Data tetap ada saat listrik mati.3. Flash Drive (USB) Portable, menggunakan USB interface dan flash memory. Kapasitas bervariasi: 8 GB – 2 TB. Digunakan untuk menyimpan, mencadangkan, dan memindahkan data. 4. Compact Disc (CD) Cakram optik digital. Digunakan untuk audio atau data. Format: CD-ROM, CD-R, CD-RW, VCD, dll. Kapasitas umum: 700 MB. 5. Memory Card (SD Card) Digunakan pada kamera, smartphone, dan tablet. Ada fitur CPRM dan Write-Protect. Bentuk: SD, MiniSD, MicroSD (paling kecil). 6. Cloud Storage Penyimpanan data melalui internet ke server penyedia layanan.  Data bisa diakses di mana saja, kapan saja dengan internet. Contoh layanan: Google Drive, Dropbox, pCloud. Keunggulan: akses fleksibel, berbagi mudah, dan keamanan terjamin."
    },
    {
        "judul": "5. Perangkat Lainnya",
        "deskripsi": "Selain komponen utama, ada peranti tambahan yang mendukung fungsi dan kinerja komputer. Beberapa di antaranya: 1. Motherboard (Mainboard) Merupakan papan sirkuit utama dalam komputer. Tempat menghubungkan dan memasang komponen penting seperti: Processor (CPU), RAM, Hard Disk / SSD,VGA Card, Sound Card, dll.  Semua perangkat berkomunikasi melalui motherboard.  2. VGA Card (Video Graphics Array Card) Berfungsi untuk mengolah data grafis/video dari CPU. Hasil olahan ditampilkan di layar monitor. Penting untuk tampilan visual, seperti game, video editing, dan desain grafis. 3. Sound Car Mengubah sinyal digital dari komputer menjadi sinyal suara. Sinyal suara dikirim ke speaker atau headphone. Digunakan untuk mendengarkan musik, suara video, dan kegiatan audio lainnya. 4. GPU (Graphics Processing Unit) Merupakan prosesor khusus untuk menangani pemrosesan grafis dan gambar. Lebih efisien dan cepat daripada CPU dalam mengolah grafis karena struktur paralelnya. Digunakan dalam: Komputer pribadi (PC) Laptop Konsol game<br>Ponsel dan sistem tertanam (embedded system) Bisa berupa:<br>kartu grafis terpisah (dedicated GPU) GPU tertanam di motherboard atau CPU (integrated GPU)"
    }
]